In [1]:
from pandas import Series, DataFrame
import pandas as pd

In [2]:
import numpy as np
import matplotlib.pyplot as plt
np.set_printoptions(precision=4, suppress=True)

In [9]:
df1 = DataFrame({'key':list('bbacaab'),'data1':range(7)})
df2 = DataFrame({'key':list('abd'),'data2':range(3)})

In [10]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [11]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [12]:
pd.merge(df1,df2)

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [13]:
pd.merge(df1,df2,on='key')

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [14]:
df3 = DataFrame({'lkey':list('bbacaab'),'data1':range(7)})
df4 = DataFrame({'rkey':list('abd'),'data2':range(3)})

In [17]:
a = pd.merge(df3,df4,left_on='lkey',right_on='rkey')

In [20]:
a.sort_values('lkey',inplace=True)

In [21]:
pd.merge(df1,df2,how='outer')

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0
6      3   c    NaN
7    NaN   d      2

In [22]:
df1 = DataFrame({'key':list('bbacab'),'data1':range(6)})
df2 = DataFrame({'key':list('ababd'),'data2':range(5)})

In [23]:
pd.merge(df1,df2,on='key',how= 'left')

    data1 key  data2
0       0   b      1
1       0   b      3
2       1   b      1
3       1   b      3
4       2   a      0
5       2   a      2
6       3   c    NaN
7       4   a      0
8       4   a      2
9       5   b      1
10      5   b      3

In [24]:
pd.merge(df1,df2,on='key',how='inner')

   data1 key  data2
0      0   b      1
1      0   b      3
2      1   b      1
3      1   b      3
4      5   b      1
5      5   b      3
6      2   a      0
7      2   a      2
8      4   a      0
9      4   a      2

In [25]:
left = DataFrame({'key1': ['foo', 'foo', 'bar'],
                  'key2': ['one', 'two', 'one'],
                  'lval': [1, 2, 3]})
right = DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                   'key2': ['one', 'one', 'one', 'two'],
                   'rval': [4, 5, 6, 7]})

In [26]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [28]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [27]:
pd.merge(left,right,on=['key1','key2'],how='outer' )

  key1 key2  lval  rval
0  foo  one     1     4
1  foo  one     1     5
2  foo  two     2   NaN
3  bar  one     3     6
4  bar  two   NaN     7

In [29]:
pd.merge(left,right,on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [30]:
pd.merge(left,right,on='key1',suffixes=('_left','_right'))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

In [32]:
left1 = DataFrame({'key':list('abaabc'),'value':range(6)})
right1 = DataFrame({'group_val':[3.5,7]},index = list('ab'))

In [33]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [34]:
right1

   group_val
a        3.5
b        7.0

In [35]:
pd.merge(left1,right1,left_on='key',right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [36]:
pd.merge(left1,right1,left_on='key',right_index=True,how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [52]:
lefth = DataFrame({'key1':['Ohio','Ohio','Ohio','Nevada','Nevada'],
                                  'key2':[2000,2001,2002,2001,2002],
                                   'data':np.arange(5.)})

In [53]:
lefth

   data    key1  key2
0     0    Ohio  2000
1     1    Ohio  2001
2     2    Ohio  2002
3     3  Nevada  2001
4     4  Nevada  2002

In [54]:
righth = DataFrame(np.arange(12).reshape((6,2)),
                                 index = [['Nevada','Nevada','Ohio','Ohio','Ohio','Ohio'],
                                  [2001,2000,2000,2000,2001,2002]],
                                   columns = ['event1','event2'])

In [55]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [56]:
pd.merge(lefth,righth,left_on = ['key1','key2'],right_index=True,how ='outer')

   data    key1  key2  event1  event2
0     0    Ohio  2000       4       5
0     0    Ohio  2000       6       7
1     1    Ohio  2001       8       9
2     2    Ohio  2002      10      11
3     3  Nevada  2001       0       1
4     4  Nevada  2002     NaN     NaN
4   NaN  Nevada  2000       2       3

In [57]:
left2 = DataFrame([[1.,2.],[3.,4.],[5.,6.]],index=list('ace'),columns = ['Ohio','Nevada'])
right2 = DataFrame([[7.,8.],[9.,10.],[11.,12.],[13.,14.]],index=list('bcde'),columns = ['Missouri','Alabama'])

In [58]:
left2

   Ohio  Nevada
a     1       2
c     3       4
e     5       6

In [59]:
right2

   Missouri  Alabama
b         7        8
c         9       10
d        11       12
e        13       14

In [60]:
pd.merge(left2,right2,how='outer',left_index=True,right_index=True)

   Ohio  Nevada  Missouri  Alabama
a     1       2       NaN      NaN
b   NaN     NaN         7        8
c     3       4         9       10
d   NaN     NaN        11       12
e     5       6        13       14

In [61]:
left2.join(right2,how= 'outer')

   Ohio  Nevada  Missouri  Alabama
a     1       2       NaN      NaN
b   NaN     NaN         7        8
c     3       4         9       10
d   NaN     NaN        11       12
e     5       6        13       14

In [62]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [63]:
right1

   group_val
a        3.5
b        7.0

In [64]:
left1.join(right1,on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [65]:
another = DataFrame([[7.,8.],[9.,10.],[11.,12.],[16.,17.]],index=list('acef'),columns = ['New York','Oregon'])

In [67]:
another

   New York  Oregon
a         7       8
c         9      10
e        11      12
f        16      17

In [68]:
left2.join([right2,another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a     1       2       NaN      NaN         7       8
c     3       4         9       10         9      10
e     5       6        13       14        11      12

In [69]:
right2

   Missouri  Alabama
b         7        8
c         9       10
d        11       12
e        13       14

In [70]:
left2

   Ohio  Nevada
a     1       2
c     3       4
e     5       6

In [73]:
left2.join([right2,another],how = 'outer')

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a     1       2       NaN      NaN         7       8
b   NaN     NaN         7        8       NaN     NaN
c     3       4         9       10         9      10
d   NaN     NaN        11       12       NaN     NaN
e     5       6        13       14        11      12
f   NaN     NaN       NaN      NaN        16      17

In [74]:
arr = np.arange(12).reshape((3,4))
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [75]:
np.concatenate([arr,arr],axis =1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [76]:
s1 = Series([0,1],index=list('ab'))
s2 = Series([2,3,4],index=list('cde'))
s3 = Series([5,6],index=list('fg'))

In [77]:
pd.concat([s1,s2,s3],axis = 1)

    0   1   2
a   0 NaN NaN
b   1 NaN NaN
c NaN   2 NaN
d NaN   3 NaN
e NaN   4 NaN
f NaN NaN   5
g NaN NaN   6

In [79]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [80]:
s4 = pd.concat([s1*5,s3])
s4

a    0
b    5
f    5
g    6
dtype: int64

In [81]:
pd.concat([s1,s4],axis=1)

    0  1
a   0  0
b   1  5
f NaN  5
g NaN  6

In [82]:
pd.concat([s1,s4],axis=0)

a    0
b    1
a    0
b    5
f    5
g    6
dtype: int64

In [83]:
pd.concat([s1,s4] , axis = 1, join='inner')

   0  1
a  0  0
b  1  5

In [84]:
pd.concat([s1,s4], axis=1,join_axes=[list('acbe')])

    0   1
a   0   0
c NaN NaN
b   1   5
e NaN NaN

In [88]:
result = pd.concat([s1,s2,s3],keys=['one','two','three'])
result

one    a    0
       b    1
two    c    2
       d    3
       e    4
three  f    5
       g    6
dtype: int64

In [89]:
result.unstack()

        a   b   c   d   e   f   g
one     0   1 NaN NaN NaN NaN NaN
two   NaN NaN   2   3   4 NaN NaN
three NaN NaN NaN NaN NaN   5   6

In [90]:
pd.concat([s1,s2,s3],axis=1,keys=['one','two','three'])

   one  two  three
a    0  NaN    NaN
b    1  NaN    NaN
c  NaN    2    NaN
d  NaN    3    NaN
e  NaN    4    NaN
f  NaN  NaN      5
g  NaN  NaN      6

In [92]:
df1 = DataFrame(np.arange(6).reshape(3,2),index=list('abc'),columns=['one','two'])
df2 = DataFrame(5+np.arange(4).reshape(2,2),index=list('ac'),columns=['three','four'])

In [93]:
df2

   three  four
a      5     6
c      7     8

In [95]:
pd.concat([df1,df2],axis=1,keys = ['level1','level2'])

  level1     level2
     one two  three four
a      0   1      5    6
b      2   3    NaN  NaN
c      4   5      7    8

In [99]:
pd.concat({'level1':df1,'level2':df2},axis=1)

  level1     level2
     one two  three four
a      0   1      5    6
b      2   3    NaN  NaN
c      4   5      7    8

In [100]:
pd.concat([df1,df2],axis=1,keys=['level1','level2'],names=['upper','lower'])

upper level1     level2
lower    one two  three four
a          0   1      5    6
b          2   3    NaN  NaN
c          4   5      7    8

In [102]:
df1 = DataFrame(np.random.randn(3,4),columns=list('abcd'))
df2 = DataFrame(np.random.randn(2,3),columns=list('bda'))

In [103]:
df1

          a         b         c         d
0  0.620511  0.698858 -1.258888  0.002427
1 -0.827809 -1.275393 -0.086770  0.729212
2  0.885832 -0.428735 -0.009351  1.096722

In [105]:
df2

          b         d         a
0  0.230813  0.282501 -0.566718
1  0.713182 -2.662593  0.114818

In [104]:
pd.concat([df1,df2],ignore_index=True)

          a         b         c         d
0  0.620511  0.698858 -1.258888  0.002427
1 -0.827809 -1.275393 -0.086770  0.729212
2  0.885832 -0.428735 -0.009351  1.096722
3 -0.566718  0.230813       NaN  0.282501
4  0.114818  0.713182       NaN -2.662593

In [107]:
a = Series([np.nan,2.5,np.nan,3.5,4.5,np.nan],index=list('fedcba'))
b = Series(np.arange(len(a),dtype=np.float64),index=list('fedcba'))

In [108]:
len(a)

6

In [109]:
b

f    0
e    1
d    2
c    3
b    4
a    5
dtype: float64

In [111]:
b[-1] = np.nan

In [117]:
a[2:]

d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [116]:
b[:-2]

f    0
e    1
d    2
c    3
dtype: float64

In [115]:
b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [118]:
df1 = DataFrame({'a':[1.,np.nan,5.,np.nan],
                                 'b':[np.nan,2.,np.nan,6.],
                                  'c':range(2,18,4)})

In [121]:
df2 = DataFrame({'a':[5.,4.,np.nan,3.,7.],
                                 'b':[np.nan,3.,4.,6.,8.]
                                  })

In [122]:
df1.combine_first(df2)

   a   b   c
0  1 NaN   2
1  4   2   6
2  5   4  10
3  3   6  14
4  7   8 NaN

In [123]:
df1

    a   b   c
0   1 NaN   2
1 NaN   2   6
2   5 NaN  10
3 NaN   6  14

In [124]:
df2

    a   b
0   5 NaN
1   4   3
2 NaN   4
3   3   6
4   7   8

In [125]:
data  = DataFrame(np.arange(6).reshape((2,3)),index=pd.Index(['Ohio','Colorado'],name='state'),
                                  columns = pd.Index(['one','two','three'],name = 'number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [126]:
result = data.stack()

In [127]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [128]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [130]:
result.unstack(level=1)

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [131]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [147]:
s1 = Series([0,1,2,3],index=list('abcd'))
s2 = Series([4,5,6],index=list('cde'))
data2 = pd.concat([s1,s2],keys = ['one','two'])

In [148]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [149]:
data2.unstack(level = 1)

      a   b  c  d   e
one   0   1  2  3 NaN
two NaN NaN  4  5   6

In [150]:
data2.unstack().stack()

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: float64

In [146]:
data2.reset_index([0,1])

  level_0 level_1  0
0     one       a  0
1     one       b  1
2     one       c  2
3     one       d  3
4     two       c  4
5     two       d  5
6     two       e  6

In [151]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [153]:
data2.unstack().stack(dropna=False)

one  a     0
     b     1
     c     2
     d     3
     e   NaN
two  a   NaN
     b   NaN
     c     4
     d     5
     e     6
dtype: float64

In [155]:
df = DataFrame({'left':result,'right':result+5},columns=pd.Index(['left','right'],name = 'side'))

In [156]:
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [158]:
df.unstack('state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [159]:
df.unstack('state').stack('side')

state         Ohio  Colorado
number side
one    left      0         3
       right     5         8
two    left      1         4
       right     6         9
three  left      2         5
       right     7        10

In [168]:
data = pd.read_csv('macrodata.csv')
periods = pd.PeriodIndex(year=data.year, quarter=data.quarter, name='date')
data = DataFrame(data.to_records(),
                 columns=pd.Index(['realgdp', 'infl', 'unemp'], name='item'),
                 index=periods.to_timestamp('D', 'end'))

ldata = data.stack().reset_index().rename(columns={0: 'value'})
wdata = ldata.pivot('date', 'item', 'value')

In [169]:
ldata[:10]

        date     item     value
0 1959-03-31  realgdp  2710.349
1 1959-03-31     infl     0.000
2 1959-03-31    unemp     5.800
3 1959-06-30  realgdp  2778.801
4 1959-06-30     infl     2.340
5 1959-06-30    unemp     5.100
6 1959-09-30  realgdp  2775.488
7 1959-09-30     infl     2.740
8 1959-09-30    unemp     5.300
9 1959-12-31  realgdp  2785.204

In [170]:
pivoted = ldata.pivot('date','item','value')
pivoted.head()

item        infl   realgdp  unemp
date
1959-03-31  0.00  2710.349    5.8
1959-06-30  2.34  2778.801    5.1
1959-09-30  2.74  2775.488    5.3
1959-12-31  0.27  2785.204    5.6
1960-03-31  2.31  2847.699    5.2

In [171]:
ldata['value2'] = np.random.randn(len(ldata))

In [172]:
ldata[:10]

        date     item     value    value2
0 1959-03-31  realgdp  2710.349 -1.445022
1 1959-03-31     infl     0.000 -0.384996
2 1959-03-31    unemp     5.800  2.651738
3 1959-06-30  realgdp  2778.801 -0.658903
4 1959-06-30     infl     2.340 -0.434372
5 1959-06-30    unemp     5.100 -0.864638
6 1959-09-30  realgdp  2775.488 -0.264979
7 1959-09-30     infl     2.740 -1.118732
8 1959-09-30    unemp     5.300  1.078386
9 1959-12-31  realgdp  2785.204 -0.437359

In [173]:
pivoted = ldata.pivot('date','item')

In [174]:
pivoted[:5]

           value                    value2
item        infl   realgdp unemp      infl   realgdp     unemp
date
1959-03-31  0.00  2710.349   5.8 -0.384996 -1.445022  2.651738
1959-06-30  2.34  2778.801   5.1 -0.434372 -0.658903 -0.864638
1959-09-30  2.74  2775.488   5.3 -1.118732 -0.264979  1.078386
1959-12-31  0.27  2785.204   5.6 -0.101539 -0.437359  1.040206
1960-03-31  2.31  2847.699   5.2 -0.216746  0.709030 -0.152136

In [175]:
ldata[:5]

        date     item     value    value2
0 1959-03-31  realgdp  2710.349 -1.445022
1 1959-03-31     infl     0.000 -0.384996
2 1959-03-31    unemp     5.800  2.651738
3 1959-06-30  realgdp  2778.801 -0.658903
4 1959-06-30     infl     2.340 -0.434372

In [176]:
pivoted['value'][:5]

item        infl   realgdp  unemp
date
1959-03-31  0.00  2710.349    5.8
1959-06-30  2.34  2778.801    5.1
1959-09-30  2.74  2775.488    5.3
1959-12-31  0.27  2785.204    5.6
1960-03-31  2.31  2847.699    5.2

In [177]:
unstacked = ldata.set_index(['date','item'])

In [180]:
unstacked.unstack('item')

           value                     value2
item        infl    realgdp unemp      infl   realgdp     unemp
date
1959-03-31  0.00   2710.349   5.8 -0.384996 -1.445022  2.651738
1959-06-30  2.34   2778.801   5.1 -0.434372 -0.658903 -0.864638
1959-09-30  2.74   2775.488   5.3 -1.118732 -0.264979  1.078386
1959-12-31  0.27   2785.204   5.6 -0.101539 -0.437359  1.040206
1960-03-31  2.31   2847.699   5.2 -0.216746  0.709030 -0.152136
1960-06-30  0.14   2834.390   5.2  0.042842  0.766489 -0.593338
1960-09-30  2.70   2839.022   5.6 -0.279444 -0.527464 -1.145474
1960-12-31  1.21   2802.616   6.3 -0.018533 -2.050166  0.991105
1961-03-31 -0.40   2819.264   6.8 -2.526808 -1.366448  0.972675
1961-06-30  1.47   2872.005   7.0 -0.639754  0.745413 -1.016492
1961-09-30  0.80   2918.419   6.8  0.338913  0.800743  0.260569
1961-12-31  0.80   2977.830   6.2 -0.798495 -0.706269  0.512991
1962-03-31  2.26   3031.241   5.6 -2.601718 -1.602427  0.849732
1962-06-30  0.13   3064.709   5.5 -2.097696  1.580986  1.081432
1962-09-30  2.11   3093.047   5.6 -0.371405 -1.596320 -1.410255
1962-12-31  0.79   3100.563   5.5 -0.354815 -0.949746  1.323253
1963-03-31  0.53   3141.087   5.8  0.051482  0.137564  0.928267
1963-06-30  2.75   3180.447   5.7 -1.830261  0.068192  0.127313
1963-09-30  0.78   3240.332   5.5  0.509541  0.769634  1.718229
1963-12-31  2.46   3264.967   5.6  0.907707 -0.263760 -0.585900
1964-03-31  0.13   3338.246   5.5  0.782991  0.635245  0.301368
1964-06-30  0.90   3376.587   5.2 -0.508638 -0.206274  0.332994
1964-09-30  1.29   3422.469   5.0  0.613152 -0.177477 -1.633414
1964-12-31  2.05   3431.957   5.0 -0.479890  2.069781 -1.559128
1965-03-31  1.28   3516.251   4.9  1.086071  0.892057 -0.117173
1965-06-30  2.54   3563.960   4.7  0.220561 -0.715623  1.018840
1965-09-30  0.89   3636.285   4.4  1.454082 -1.477174 -1.210325
1965-12-31  2.90   3724.014   4.1  0.097833 -1.905945  0.591557
1966-03-31  4.99   3815.423   3.9 -0.241178  1.487510  0.243063
1966-06-30  2.10   3828.124   3.8  1.250552  1.342966 -0.973808
...          ...        ...   ...       ...       ...       ...
2002-06-30  1.56  11538.770   5.8 -0.132823 -1.205922 -0.457372
2002-09-30  2.66  11596.430   5.7 -2.106983 -2.203412 -0.527345
2002-12-31  3.08  11598.824   5.8  1.978532  0.822157 -0.744649
2003-03-31  1.31  11645.819   5.9 -1.260639 -1.801625 -0.375383
2003-06-30  1.09  11738.706   6.2 -0.638973 -0.128454  0.483608
2003-09-30  2.60  11935.461   6.1 -0.410846 -1.263683  0.248794
2003-12-31  3.02  12042.817   5.8  0.563053 -1.084029 -0.076783
2004-03-31  2.35  12127.623   5.7  1.451590  0.274709 -1.051524
2004-06-30  3.61  12213.818   5.6  0.264260  0.724490  1.076697
2004-09-30  3.58  12303.533   5.4 -1.722576 -0.149953  0.408338
2004-12-31  2.09  12410.282   5.4 -2.711670  0.630138  0.987069
2005-03-31  4.15  12534.113   5.3 -0.279453 -0.807758 -0.836756
2005-06-30  1.85  12587.535   5.1 -0.990349 -0.295205  1.811394
2005-09-30  9.14  12683.153   5.0  0.075339  1.129603 -2.373426
2005-12-31  0.40  12748.699   4.9 -0.337494 -0.383569 -0.451579
2006-03-31  2.60  12915.938   4.7  0.150180  1.671335 -0.812794
2006-06-30  3.97  12962.462   4.7 -0.522647  2.163383 -0.222882
2006-09-30 -1.58  12965.916   4.7  0.746836  0.165821 -0.212508
2006-12-31  3.30  13060.679   4.4  0.151372 -0.482120  0.691430
2007-03-31  4.58  13099.901   4.5  0.026986  0.605380  1.647553
2007-06-30  2.75  13203.977   4.5  0.153563 -0.448576 -1.581310
2007-09-30  3.45  13321.109   4.7  1.695073 -1.213291 -1.264302
2007-12-31  6.38  13391.249   4.8 -0.743889  0.004178  2.406091
2008-03-31  2.82  13366.865   4.9 -2.313572 -0.672557 -0.950966
2008-06-30  8.53  13415.266   5.4  1.196695 -0.063907 -1.001336
2008-09-30 -3.16  13324.600   6.0  0.400142  1.642155 -0.692350
2008-12-31 -8.79  13141.920   6.9 -0.089328  0.889027 -1.678571
2009-03-31  0.94  12925.410   8.1  1.510582 -0.281071  0.510012
2009-06-30  3.37  12901.504   9.2  0.772572  0.840557  0.026325
2009-09-30  3.56  12990.341   9.6 -0.579084  1.028719 -0.161278

[203 rows x 6 columns]

In [181]:
data = DataFrame({'k1':['one']*3+['two']*4,
                                'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [182]:
data.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [183]:
data.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [185]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [186]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
3  two   3   3

In [190]:
data.drop_duplicates(['k1','k2'],keep = 'last')

    k1  k2  v1
1  one   1   1
2  one   2   2
4  two   3   4
6  two   4   6

In [191]:
data = DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami',
                           'corned beef', 'Bacon', 'pastrami', 'honey ham',
                           'nova lox'],
                  'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [192]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [193]:
meat_to_animal

{'bacon': 'pig',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon',
 'pastrami': 'cow',
 'pulled pork': 'pig'}

In [196]:
data['animal'] = data['food'].map(str.lower).map(meat_to_animal)

In [197]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [198]:
data['food'].map(lambda x : meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [204]:
data['food'].str.lower()

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [205]:
data = Series([1.,-999.,2.,-999.,-1000.,3.])

In [206]:
data

0       1
1    -999
2       2
3    -999
4   -1000
5       3
dtype: float64

In [207]:
data.replace(-999,np.nan)

0       1
1     NaN
2       2
3     NaN
4   -1000
5       3
dtype: float64

In [208]:
data.replace([-999,-1000],[np.nan,0])

0     1
1   NaN
2     2
3   NaN
4     0
5     3
dtype: float64

In [209]:
data.replace({-999:np.nan,-1000:0})

0     1
1   NaN
2     2
3   NaN
4     0
5     3
dtype: float64

In [210]:
data = DataFrame(np.arange(12).reshape((3, 4)),
                 index=['Ohio', 'Colorado', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [212]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [213]:
data.index.map(str.upper)

array(['OHIO', 'COLORADO', 'NEW YORK'], dtype=object)

In [214]:
data.index = data.index.map(str.upper)

In [215]:
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [216]:
data.rename(index=str.title,columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [217]:
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [218]:
data.rename(index={'OHIO':'INDIANA'},columns={'three':'peekaboo'})

          one  two  peekaboo  four
INDIANA     0    1         2     3
COLORADO    4    5         6     7
NEW YORK    8    9        10    11

In [219]:
_ = data.rename(index={'OHIO':'INDIANA'},inplace=True)

In [222]:
data

          one  two  three  four
INDIANA     0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [223]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [224]:
bins = [18,25,35,60,100]
cats = pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, object): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [226]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [228]:
cats.categories

Index(['(18, 25]', '(25, 35]', '(35, 60]', '(60, 100]'], dtype='object')

In [229]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [230]:
pd.cut(ages,[18,26,36,61,100],right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, object): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [231]:
group_names = ['Youth','YoungAdult','MiddleAged','Senior']

In [234]:
pd.cut(ages,bins,labels = group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [235]:
data = np.random.rand(20)

In [238]:
pd.cut(data,4,precision=2)

[(0.73, 0.95], (0.085, 0.3], (0.3, 0.52], (0.52, 0.73], (0.73, 0.95], ..., (0.3, 0.52], (0.3, 0.52], (0.73, 0.95], (0.52, 0.73], (0.73, 0.95]]
Length: 20
Categories (4, object): [(0.085, 0.3] < (0.3, 0.52] < (0.52, 0.73] < (0.73, 0.95]]

In [239]:
pd.cut(data,4,precision=5)

[(0.73067, 0.94565], (0.084896, 0.30073], (0.30073, 0.5157], (0.5157, 0.73067], (0.73067, 0.94565], ..., (0.30073, 0.5157], (0.30073, 0.5157], (0.73067, 0.94565], (0.5157, 0.73067], (0.73067, 0.94565]]
Length: 20
Categories (4, object): [(0.084896, 0.30073] < (0.30073, 0.5157] < (0.5157, 0.73067] < (0.73067, 0.94565]]

In [240]:
data = np.random.randn(1000)
cats = pd.qcut(data,4) #
cats

[(-0.706, 0.00992], (-0.706, 0.00992], (0.644, 3.432], (-0.706, 0.00992], (-0.706, 0.00992], ..., (0.644, 3.432], (0.00992, 0.644], (-0.706, 0.00992], (-0.706, 0.00992], (-0.706, 0.00992]]
Length: 1000
Categories (4, object): [[-3.509, -0.706] < (-0.706, 0.00992] < (0.00992, 0.644] < (0.644, 3.432]]

In [241]:
pd.value_counts(cats)

(0.644, 3.432]       250
(0.00992, 0.644]     250
(-0.706, 0.00992]    250
[-3.509, -0.706]     250
dtype: int64

In [243]:
pd.value_counts(pd.qcut(data,[0,0.1,0.5,0.9,1.]))

(0.00992, 1.211]     400
(-1.335, 0.00992]    400
(1.211, 3.432]       100
[-3.509, -1.335]     100
dtype: int64

In [245]:
np.random.seed(12345)

In [246]:
data = DataFrame(np.random.randn(1000,4))

In [248]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067684     0.067924     0.025598    -0.002298
std       0.998035     0.992106     1.006835     0.996794
min      -3.428254    -3.548824    -3.184377    -3.745356
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.366626     2.653656     3.260383     3.927528

In [250]:
col = data[3]
col.head()

0   -0.555730
1    0.281746
2   -1.296221
3    0.886429
4   -0.438570
Name: 3, dtype: float64

In [251]:
data.head()

          0         1         2         3
0 -0.204708  0.478943 -0.519439 -0.555730
1  1.965781  1.393406  0.092908  0.281746
2  0.769023  1.246435  1.007189 -1.296221
3  0.274992  0.228913  1.352917  0.886429
4 -2.001637 -0.371843  1.669025 -0.438570

In [252]:
col[np.abs(col)>3]

97     3.927528
305   -3.399312
400   -3.745356
Name: 3, dtype: float64

In [268]:
data[(np.abs(data)>3).any(axis=1)]

            0         1         2         3
5   -0.539741  0.476985  3.248944 -1.021228
97  -0.774363  0.552936  0.106061  3.927528
102 -0.655054 -0.565230  3.176873  0.959533
305 -2.315555  0.457246 -0.025907 -3.399312
324  0.050188  1.951312  3.260383  0.963301
400  0.146326  0.508391 -0.196713 -3.745356
499 -0.293333 -0.242459 -3.056990  1.918403
523 -3.428254 -0.296336 -0.439938 -0.867165
586  0.275144  1.179227 -3.184377  1.369891
808 -0.362528 -3.548824  1.553205 -2.186301
900  3.366626 -2.372214  0.851010  1.332846

In [270]:
data[np.abs(data)>3] = np.sign(data)*3

In [271]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.067623     0.068473     0.025153    -0.002081
std       0.995485     0.990253     1.003977     0.989736
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.774890    -0.591841    -0.641675    -0.644144
50%      -0.116401     0.101143     0.002073    -0.013611
75%       0.616366     0.780282     0.680391     0.654328
max       3.000000     2.653656     3.000000     3.000000

In [272]:
df = DataFrame(np.arange(5*4).reshape(5,4))

In [273]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [278]:
sampler = np.random.permutation(5)

In [279]:
sampler

array([1, 3, 4, 0, 2])

In [280]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [281]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
4  16  17  18  19
0   0   1   2   3
2   8   9  10  11

In [282]:
df.take(np.random.permutation(len(df))[:3])

    0   1   2   3
0   0   1   2   3
3  12  13  14  15
1   4   5   6   7

In [283]:
len(df)

5

In [284]:
bag = np.array([5,7,-1,6,4])

In [285]:
bag

array([ 5,  7, -1,  6,  4])

In [286]:
sampler = np.random.randint(0,len(bag),size= 10)

In [287]:
sampler

array([2, 3, 0, 1, 2, 2, 3, 2, 1, 2])

In [288]:
draws = bag.take(sampler)
draws

array([-1,  6,  5,  7, -1, -1,  6, -1,  7, -1])

In [290]:
df = DataFrame({'key':list('bbacab'),'data1':range(6)})
df

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [291]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [293]:
dummies = pd.get_dummies(df['key'],prefix='key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [294]:
df

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [296]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [297]:
df['data1']

0    0
1    1
2    2
3    3
4    4
5    5
Name: data1, dtype: int64

In [298]:
df[['data1']]

   data1
0      0
1      1
2      2
3      3
4      4
5      5

In [300]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('movies.dat', sep='::', header=None,
                        names=mnames)
movies[:10]

/Users/keeeeei/.pyenv/versions/anaconda3-2.5.0/lib/python3.5/site-packages/ipykernel/__main__.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators; you can avoid this warning by specifying engine='python'.
  app.launch_new_instance()

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [302]:
genre_iter = (set(x.split('|')) for  x in movies.genres)
genre_iter

In [303]:
genres = sorted(set.union(*genre_iter))
genres

['Action',
 'Adventure',
 'Animation',
 "Children's",
 'Comedy',
 'Crime',
 'Documentary',
 'Drama',
 'Fantasy',
 'Film-Noir',
 'Horror',
 'Musical',
 'Mystery',
 'Romance',
 'Sci-Fi',
 'Thriller',
 'War',
 'Western']

In [306]:
dummies = DataFrame(np.zeros((len(movies),len(genres))),columns=genres)
dummies

,Action,Adventure,Animation,Children's,Comedy,Crime,Documentary,Drama,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
2,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
5,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
6,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
7,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
8,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
9,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
10,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
11,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
12,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
13,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
14,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
15,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
16,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
17,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
18,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
19,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
20,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
21,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
22,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
23,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
24,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
25,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
26,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
27,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
28,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
29,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3853,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3854,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3855,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3856,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3857,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3858,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3859,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3860,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3861,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3862,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3863,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3864,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3865,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3866,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3867,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3868,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3869,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3870,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3871,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3872,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3873,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3874,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3875,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3876,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3877,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3878,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3879,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3880,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3881,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3882,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0

In [305]:
np.zeros((len(movies),len(genres)))

array([[ 0.,  0.,  0., ...,  0.,  0.,  0.],
       [ 0.,  0.,  0., ...,  0.,  0.,  0.],
       [ 0.,  0.,  0., ...,  0.,  0.,  0.],
       ...,
       [ 0.,  0.,  0., ...,  0.,  0.,  0.],
       [ 0.,  0.,  0., ...,  0.,  0.,  0.],
       [ 0.,  0.,  0., ...,  0.,  0.,  0.]])

In [308]:
for i , gen in enumerate(movies.genres):
     dummies.ix[i,gen.split('|')] = 1

In [310]:
dummies.head()

,Action,Adventure,Animation,Children's,Comedy,Crime,Documentary,Drama,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0
1,0,1,0,1,0,0,0,0,1,0,0,0,0,0,0,0,0,0
2,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0
3,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0

In [311]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))

In [320]:
movies_windic.iloc[:,0]

0          1
1          2
2          3
3          4
4          5
5          6
6          7
7          8
8          9
9         10
10        11
11        12
12        13
13        14
14        15
15        16
16        17
17        18
18        19
19        20
20        21
21        22
22        23
23        24
24        25
25        26
26        27
27        28
28        29
29        30
        ...
3853    3923
3854    3924
3855    3925
3856    3926
3857    3927
3858    3928
3859    3929
3860    3930
3861    3931
3862    3932
3863    3933
3864    3934
3865    3935
3866    3936
3867    3937
3868    3938
3869    3939
3870    3940
3871    3941
3872    3942
3873    3943
3874    3944
3875    3945
3876    3946
3877    3947
3878    3948
3879    3949
3880    3950
3881    3951
3882    3952
Name: movie_id, dtype: int64

In [316]:
movies_windic.head()

,movie_id,title,genres,Genre_Action,Genre_Adventure,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Crime,Genre_Documentary,...,Genre_Fantasy,Genre_Film-Noir,Genre_Horror,Genre_Musical,Genre_Mystery,Genre_Romance,Genre_Sci-Fi,Genre_Thriller,Genre_War,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,0,0,1,1,1,0,0,...,0,0,0,0,0,0,0,0,0,0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0,1,0,1,0,0,0,...,1,0,0,0,0,0,0,0,0,0
2,3,Grumpier Old Men (1995),Comedy|Romance,0,0,0,0,1,0,0,...,0,0,0,0,0,1,0,0,0,0
3,4,Waiting to Exhale (1995),Comedy|Drama,0,0,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
4,5,Father of the Bride Part II (1995),Comedy,0,0,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0

In [321]:
values = np.random.rand(10)
values

array([ 0.8556,  0.5874,  0.1531,  0.595 ,  0.3851,  0.4474,  0.3241,
        0.9236,  0.5192,  0.5311])

In [323]:
bins = [0,0.2,0.4,0.6,0.8,1]

In [324]:
pd.get_dummies(pd.cut(values,bins))

   (0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1]
0         0           0           0           0         1
1         0           0           1           0         0
2         1           0           0           0         0
3         0           0           1           0         0
4         0           1           0           0         0
5         0           0           1           0         0
6         0           1           0           0         0
7         0           0           0           0         1
8         0           0           1           0         0
9         0           0           1           0         0

In [325]:
pd.cut(values,bins)

[(0.8, 1], (0.4, 0.6], (0, 0.2], (0.4, 0.6], (0.2, 0.4], (0.4, 0.6], (0.2, 0.4], (0.8, 1], (0.4, 0.6], (0.4, 0.6]]
Categories (5, object): [(0, 0.2] < (0.2, 0.4] < (0.4, 0.6] < (0.6, 0.8] < (0.8, 1]]

In [326]:
val = 'a,b, guido'
val

'a,b, guido'

In [327]:
val.split(',')

['a', 'b', ' guido']

In [328]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [329]:
first,second,third = pieces

In [333]:
first + '::' + second + '::' + third

'a::b::guido'

In [334]:
'::'.join(pieces)

'a::b::guido'

In [336]:
'guido' in val

True

In [343]:
val.find(':')

-1

In [344]:
val.count(',')

2

In [345]:
val.replace(',','::')

'a::b:: guido'

In [346]:
val.replace(',','')

'ab guido'

In [347]:
import re

In [348]:
text = "foo    bar\t baz  \tqux"
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

In [349]:
regex = re.compile('\s+')

In [350]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [351]:
regex.findall(text)

['    ', '\t ', '  \t']

In [352]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [353]:
text

'Dave dave@google.com\nSteve steve@gmail.com\nRob rob@gmail.com\nRyan ryan@yahoo.com\n'

In [354]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [390]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = Series(data)

In [381]:
data

Dave     dave@google.com
Rob        rob@gmail.com
Steve    steve@gmail.com
Wes                  NaN
dtype: object

In [382]:
data.isnull()

Dave     False
Rob      False
Steve    False
Wes       True
dtype: bool

In [392]:
data.str.contains('gmail')

Dave     False
Rob       True
Steve     True
Wes        NaN
dtype: object

In [361]:
data.isin(['gmail'])

Dave     False
Rob      False
Steve    False
Wes      False
dtype: bool

In [388]:
pattern

'[A-Z0-9._%+-]+@[A-Z0-9.-]+\\.[A-Z]{2,4}'

In [391]:
data.str.findall(pattern,flags=re.IGNORECASE)

Dave     [dave@google.com]
Rob        [rob@gmail.com]
Steve    [steve@gmail.com]
Wes                    NaN
dtype: object

In [386]:
matches = data.str.match(pattern,flags=re.IGNORECASE)

In [387]:
matches

Dave     True
Rob      True
Steve    True
Wes       NaN
dtype: object

In [378]:
matches.str.get(1)

Dave    NaN
Rob     NaN
Steve   NaN
Wes     NaN
dtype: float64

In [379]:
matches.str[0]

Dave    NaN
Rob     NaN
Steve   NaN
Wes     NaN
dtype: float64

In [393]:
data.str[:5]

Dave     dave@
Rob      rob@g
Steve    steve
Wes        NaN
dtype: object

In [395]:
import json
db = json.load(open('foods-2011-10-03.json'))
len(db)

6636

In [398]:
db[0].keys()

dict_keys(['nutrients', 'description', 'portions', 'tags', 'group', 'id', 'manufacturer'])

In [399]:
db[0]['nutrients'][0]

{'description': 'Protein',
 'group': 'Composition',
 'units': 'g',
 'value': 25.18}

In [400]:
nutrients = DataFrame(db[0]['nutrients'])

In [401]:
nutrients[:7]

                   description        group units    value
0                      Protein  Composition     g    25.18
1            Total lipid (fat)  Composition     g    29.20
2  Carbohydrate, by difference  Composition     g     3.06
3                          Ash        Other     g     3.28
4                       Energy       Energy  kcal   376.00
5                        Water  Composition     g    39.28
6                       Energy       Energy    kJ  1573.00

In [403]:
info_keys = ['description','group','id','manufacturer']

In [404]:
info = DataFrame(db,columns=info_keys)

In [405]:
info[:5]

,description,group,id,manufacturer
0,"Cheese, caraway",Dairy and Egg Products,1008,
1,"Cheese, cheddar",Dairy and Egg Products,1009,
2,"Cheese, edam",Dairy and Egg Products,1018,
3,"Cheese, feta",Dairy and Egg Products,1019,
4,"Cheese, mozzarella, part skim milk",Dairy and Egg Products,1028,

In [411]:
pd.value_counts(info.group)[:10]

Vegetables and Vegetable Products    812
Beef Products                        618
Baked Products                       496
Breakfast Cereals                    403
Fast Foods                           365
Legumes and Legume Products          365
Lamb, Veal, and Game Products        345
Sweets                               341
Pork Products                        328
Fruits and Fruit Juices              328
Name: group, dtype: int64

In [433]:
nutrients = []
for rec in db :
    fnuts = DataFrame(rec['nutrients'])
    fnuts['id'] = rec['id']
    nutrients.append(fnuts)

In [429]:
(DataFrame(db[0]['nutrients'])).head()

                   description        group units   value
0                      Protein  Composition     g   25.18
1            Total lipid (fat)  Composition     g   29.20
2  Carbohydrate, by difference  Composition     g    3.06
3                          Ash        Other     g    3.28
4                       Energy       Energy  kcal  376.00

In [432]:
db[0]['id']

1008

In [435]:
#nutrients
nutrients = pd.concat(nutrients,ignore_index=True)

In [436]:
nutrients

,description,group,units,value,id
0,Protein,Composition,g,25.180,1008
1,Total lipid (fat),Composition,g,29.200,1008
2,"Carbohydrate, by difference",Composition,g,3.060,1008
3,Ash,Other,g,3.280,1008
4,Energy,Energy,kcal,376.000,1008
5,Water,Composition,g,39.280,1008
6,Energy,Energy,kJ,1573.000,1008
7,"Fiber, total dietary",Composition,g,0.000,1008
8,"Calcium, Ca",Elements,mg,673.000,1008
9,"Iron, Fe",Elements,mg,0.640,1008
10,"Magnesium, Mg",Elements,mg,22.000,1008
11,"Phosphorus, P",Elements,mg,490.000,1008
12,"Potassium, K",Elements,mg,93.000,1008
13,"Sodium, Na",Elements,mg,690.000,1008
14,"Zinc, Zn",Elements,mg,2.940,1008
15,"Copper, Cu",Elements,mg,0.024,1008
16,"Manganese, Mn",Elements,mg,0.021,1008
17,"Selenium, Se",Elements,mcg,14.500,1008
18,"Vitamin A, IU",Vitamins,IU,1054.000,1008
19,Retinol,Vitamins,mcg,262.000,1008
20,"Vitamin A, RAE",Vitamins,mcg_RAE,271.000,1008
21,"Vitamin C, total ascorbic acid",Vitamins,mg,0.000,1008
22,Thiamin,Vitamins,mg,0.031,1008
23,Riboflavin,Vitamins,mg,0.450,1008
24,Niacin,Vitamins,mg,0.180,1008
25,Pantothenic acid,Vitamins,mg,0.190,1008
26,Vitamin B-6,Vitamins,mg,0.074,1008
27,"Folate, total",Vitamins,mcg,18.000,1008
28,Vitamin B-12,Vitamins,mcg,0.270,1008
29,Folic acid,Vitamins,mcg,0.000,1008
...,...,...,...,...,...
389325,"Selenium, Se",Elements,mcg,1.100,43546
389326,"Vitamin A, IU",Vitamins,IU,5.000,43546
389327,Retinol,Vitamins,mcg,0.000,43546
389328,"Vitamin A, RAE",Vitamins,mcg_RAE,0.000,43546
389329,"Carotene, beta",Vitamins,mcg,2.000,43546
389330,"Carotene, alpha",Vitamins,mcg,2.000,43546
389331,Vitamin E (alpha-tocopherol),Vitamins,mg,0.250,43546
389332,Vitamin D,Vitamins,IU,0.000,43546
389333,Vitamin D (D2 + D3),Vitamins,mcg,0.000,43546
389334,"Cryptoxanthin, beta",Vitamins,mcg,0.000,43546
389335,Lycopene,Vitamins,mcg,0.000,43546
389336,Lutein + zeaxanthin,Vitamins,mcg,20.000,43546
389337,"Vitamin C, total ascorbic acid",Vitamins,mg,21.900,43546
389338,Thiamin,Vitamins,mg,0.020,43546
389339,Riboflavin,Vitamins,mg,0.060,43546
389340,Niacin,Vitamins,mg,0.540,43546
389341,Vitamin B-6,Vitamins,mg,0.260,43546
389342,"Folate, total",Vitamins,mcg,17.000,43546
389343,Vitamin B-12,Vitamins,mcg,0.000,43546
389344,"Choline, total",Vitamins,mg,4.100,43546
389345,Vitamin K (phylloquinone),Vitamins,mcg,0.500,43546
389346,Folic acid,Vitamins,mcg,0.000,43546
389347,"Folate, food",Vitamins,mcg,17.000,43546
389348,"Folate, DFE",Vitamins,mcg_DFE,17.000,43546
389349,"Vitamin E, added",Vitamins,mg,0.000,43546
389350,"Vitamin B-12, added",Vitamins,mcg,0.000,43546
389351,Cholesterol,Other,mg,0.000,43546
389352,"Fatty acids, total saturated",Other,g,0.072,43546
389353,"Fatty acids, total monounsaturated",Other,g,0.028,43546
389354,"Fatty acids, total polyunsaturated",Other,g,0.041,43546

In [437]:
nutrients.duplicated().sum()

14179

In [438]:
nutrients = nutrients.drop_duplicates()

In [441]:
nutrients.shape

(375176, 5)

In [443]:
len(nutrients.columns)

5

In [444]:
col_mapping = {'description':'food',
                            'group':'fgroup'}

In [445]:
info.head()

,description,group,id,manufacturer
0,"Cheese, caraway",Dairy and Egg Products,1008,
1,"Cheese, cheddar",Dairy and Egg Products,1009,
2,"Cheese, edam",Dairy and Egg Products,1018,
3,"Cheese, feta",Dairy and Egg Products,1019,
4,"Cheese, mozzarella, part skim milk",Dairy and Egg Products,1028,

In [447]:
 info = info.rename(columns=col_mapping,copy = False)

In [448]:
info

,food,fgroup,id,manufacturer
0,"Cheese, caraway",Dairy and Egg Products,1008,
1,"Cheese, cheddar",Dairy and Egg Products,1009,
2,"Cheese, edam",Dairy and Egg Products,1018,
3,"Cheese, feta",Dairy and Egg Products,1019,
4,"Cheese, mozzarella, part skim milk",Dairy and Egg Products,1028,
5,"Cheese, mozzarella, part skim milk, low moisture",Dairy and Egg Products,1029,
6,"Cheese, romano",Dairy and Egg Products,1038,
7,"Cheese, roquefort",Dairy and Egg Products,1039,
8,"Cheese spread, pasteurized process, american, ...",Dairy and Egg Products,1048,
9,"Cream, fluid, half and half",Dairy and Egg Products,1049,
10,"Sour dressing, non-butterfat, cultured, filled...",Dairy and Egg Products,1058,
11,"Milk, filled, fluid, with blend of hydrogenate...",Dairy and Egg Products,1059,
12,"Cream substitute, liquid, with lauric acid oil...",Dairy and Egg Products,1068,
13,"Cream substitute, powdered",Dairy and Egg Products,1069,
14,"Milk, producer, fluid, 3.7% milkfat",Dairy and Egg Products,1078,
15,"Milk, reduced fat, fluid, 2% milkfat, with add...",Dairy and Egg Products,1079,None
16,"Milk, reduced fat, fluid, 2% milkfat, with add...",Dairy and Egg Products,1080,
17,"Milk, reduced fat, fluid, 2% milkfat, protein ...",Dairy and Egg Products,1081,
18,"Milk, lowfat, fluid, 1% milkfat, with added vi...",Dairy and Egg Products,1082,
19,"Milk, lowfat, fluid, 1% milkfat, with added no...",Dairy and Egg Products,1083,
20,"Milk, lowfat, fluid, 1% milkfat, protein forti...",Dairy and Egg Products,1084,
21,"Milk, nonfat, fluid, with added vitamin A and ...",Dairy and Egg Products,1085,
22,"Milk, nonfat, fluid, with added nonfat milk so...",Dairy and Egg Products,1086,
23,"Milk, nonfat, fluid, protein fortified, with a...",Dairy and Egg Products,1087,
24,"Milk, buttermilk, fluid, cultured, lowfat",Dairy and Egg Products,1088,
25,"Milk, low sodium, fluid",Dairy and Egg Products,1089,
26,"Milk, dry, whole, with added vitamin D",Dairy and Egg Products,1090,
27,"Milk, dry, nonfat, regular, without added vita...",Dairy and Egg Products,1091,
28,"Milk, dry, nonfat, instant, with added vitamin...",Dairy and Egg Products,1092,
29,"Milk, dry, nonfat, calcium reduced",Dairy and Egg Products,1093,
...,...,...,...,...
6606,"Beef, tenderloin, steak, separable lean only, ...",Beef Products,23628,
6607,"Beef, top sirloin, steak, separable lean only,...",Beef Products,23629,
6608,"Beef, short loin, top loin, steak, separable l...",Beef Products,23630,
6609,"Beef, chuck, arm pot roast, separable lean onl...",Beef Products,23631,
6610,"Beef, brisket, flat half, separable lean only,...",Beef Products,23632,
6611,"Beef, chuck, arm pot roast, separable lean onl...",Beef Products,23633,
6612,"Beef, brisket, flat half, separable lean only,...",Beef Products,23634,
6613,"Beef, round, eye of round, roast, separable le...",Beef Products,23635,
6614,"Beef, round, top round, steak, separable lean ...",Beef Products,23636,
6615,"Beef, round, bottom round, roast, separable le...",Beef Products,23637,
6616,"Beef, rib, small end (ribs 10-12), separable l...",Beef Products,23638,
6617,"CAMPBELL Soup Company, CAMPBELL'S Red and Whit...","Soups, Sauces, and Gravies",27015,Campbell Soup Co.
6618,"CAMPBELL Soup Company, CAMPBELL's Red and Whit...","Soups, Sauces, and Gravies",27016,Campbell Soup Co.
6619,"CAMPBELL Soup Company, CAMPBELL'S SELECT Soups...","Soups, Sauces, and Gravies",27021,Campbell Soup Co.
6620,"CAMPBELL Soup Company, CAMPBELL'S SOUP AT HAND...","Soups, Sauces, and Gravies",27022,Campbell Soup Co.
6621,"CAMPBELL Soup Company, CAMPBELL'S SOUP AT HAND...","Soups, Sauces, and Gravies",27023,Campbell Soup Co.
6622,"CAMPBELL Soup Company, CAMPBELL'S SELECT Gold ...","Soups, Sauces, and Gravies",27024,Campbell Soup Co.
6623,"CAMPBELL Soup Company, CAMPBELL'S SELECT Gold ...","Soups, Sauces, and Gravies",27025,Campbell Soup Co.
6624,"CAMPBELL Soup Company, CAMPBELL'S SELECT Gold ...","Soups, Sauces, and Gravies",27026,Campbell Soup Co.
6625,"CAMPBELL Soup Company, CAMPBELL'S Red and Whit...","Soups, Sauces, and Gravies",27032,Campbell Soup Co.
6626,"CAMPBELL Soup Company, V8 Vegetable Juice, Ess...",Vegetables and Vegetable Products,31010,Campbell Soup Co.
6627,"CAMPBELL Soup Company, V8 Vegetable Juice, Spi...",Vegetables and Vegetable Products,31013,Campbell Soup Co.
6628,"CAMPBELL Soup Company, PACE, Jalapenos Nacho S...",Vegetables and Vegetable Products,31014,Campbell Soup Co.
6629,"CAMPBELL Soup Company, V8 60% Vegetable Juice,...",Vegetables and Vegetable Products,31016,Campbell Soup Co.
6630,"CAMPBELL Soup Company, V8 Vegetable Juice, Low...",Vegetables and Vegetable Products,31017,Campbell Soup Co.
6631,"Bologna, beef, low fat",Sausages and Luncheon Meats,42161,
6632,"Turkey and pork sausage, fresh, bulk, patty or...",Sausages and Luncheon Meats,42173,
6633,"Babyfood, juice, pear",Baby Foods,43408,None
6634,"Babyfood, dessert, banana yogurt, strained",Baby Foods,43539,None
6635,"Babyfood, banana no tapioca, strained",Baby Foods,43546,None

In [449]:
col_mapping = {'description':'nutrient',
                            'group':'nutgroup'}

In [450]:
nutrients = nutrients.rename(columns=col_mapping,copy=False)

In [451]:
nutrients

,nutrient,nutgroup,units,value,id
0,Protein,Composition,g,25.180,1008
1,Total lipid (fat),Composition,g,29.200,1008
2,"Carbohydrate, by difference",Composition,g,3.060,1008
3,Ash,Other,g,3.280,1008
4,Energy,Energy,kcal,376.000,1008
5,Water,Composition,g,39.280,1008
6,Energy,Energy,kJ,1573.000,1008
7,"Fiber, total dietary",Composition,g,0.000,1008
8,"Calcium, Ca",Elements,mg,673.000,1008
9,"Iron, Fe",Elements,mg,0.640,1008
10,"Magnesium, Mg",Elements,mg,22.000,1008
11,"Phosphorus, P",Elements,mg,490.000,1008
12,"Potassium, K",Elements,mg,93.000,1008
13,"Sodium, Na",Elements,mg,690.000,1008
14,"Zinc, Zn",Elements,mg,2.940,1008
15,"Copper, Cu",Elements,mg,0.024,1008
16,"Manganese, Mn",Elements,mg,0.021,1008
17,"Selenium, Se",Elements,mcg,14.500,1008
18,"Vitamin A, IU",Vitamins,IU,1054.000,1008
19,Retinol,Vitamins,mcg,262.000,1008
20,"Vitamin A, RAE",Vitamins,mcg_RAE,271.000,1008
21,"Vitamin C, total ascorbic acid",Vitamins,mg,0.000,1008
22,Thiamin,Vitamins,mg,0.031,1008
23,Riboflavin,Vitamins,mg,0.450,1008
24,Niacin,Vitamins,mg,0.180,1008
25,Pantothenic acid,Vitamins,mg,0.190,1008
26,Vitamin B-6,Vitamins,mg,0.074,1008
27,"Folate, total",Vitamins,mcg,18.000,1008
28,Vitamin B-12,Vitamins,mcg,0.270,1008
29,Folic acid,Vitamins,mcg,0.000,1008
...,...,...,...,...,...
389325,"Selenium, Se",Elements,mcg,1.100,43546
389326,"Vitamin A, IU",Vitamins,IU,5.000,43546
389327,Retinol,Vitamins,mcg,0.000,43546
389328,"Vitamin A, RAE",Vitamins,mcg_RAE,0.000,43546
389329,"Carotene, beta",Vitamins,mcg,2.000,43546
389330,"Carotene, alpha",Vitamins,mcg,2.000,43546
389331,Vitamin E (alpha-tocopherol),Vitamins,mg,0.250,43546
389332,Vitamin D,Vitamins,IU,0.000,43546
389333,Vitamin D (D2 + D3),Vitamins,mcg,0.000,43546
389334,"Cryptoxanthin, beta",Vitamins,mcg,0.000,43546
389335,Lycopene,Vitamins,mcg,0.000,43546
389336,Lutein + zeaxanthin,Vitamins,mcg,20.000,43546
389337,"Vitamin C, total ascorbic acid",Vitamins,mg,21.900,43546
389338,Thiamin,Vitamins,mg,0.020,43546
389339,Riboflavin,Vitamins,mg,0.060,43546
389340,Niacin,Vitamins,mg,0.540,43546
389341,Vitamin B-6,Vitamins,mg,0.260,43546
389342,"Folate, total",Vitamins,mcg,17.000,43546
389343,Vitamin B-12,Vitamins,mcg,0.000,43546
389344,"Choline, total",Vitamins,mg,4.100,43546
389345,Vitamin K (phylloquinone),Vitamins,mcg,0.500,43546
389346,Folic acid,Vitamins,mcg,0.000,43546
389347,"Folate, food",Vitamins,mcg,17.000,43546
389348,"Folate, DFE",Vitamins,mcg_DFE,17.000,43546
389349,"Vitamin E, added",Vitamins,mg,0.000,43546
389350,"Vitamin B-12, added",Vitamins,mcg,0.000,43546
389351,Cholesterol,Other,mg,0.000,43546
389352,"Fatty acids, total saturated",Other,g,0.072,43546
389353,"Fatty acids, total monounsaturated",Other,g,0.028,43546
389354,"Fatty acids, total polyunsaturated",Other,g,0.041,43546

In [452]:
ndata = pd.merge(nutrients,info,on = 'id',how = 'outer')

In [454]:
ndata.ix[30000]

nutrient                                       Glycine
nutgroup                                   Amino Acids
units                                                g
value                                             0.04
id                                                6158
food            Soup, tomato bisque, canned, condensed
fgroup                      Soups, Sauces, and Gravies
manufacturer
Name: 30000, dtype: object

In [456]:
result = ndata.groupby(['nutrient','fgroup'])['value'].quantile(0.5)

In [458]:
result['Zinc, Zn'].order().plot(kind='barh')

/Users/keeeeei/.pyenv/versions/anaconda3-2.5.0/lib/python3.5/site-packages/ipykernel/__main__.py:1: FutureWarning: order is deprecated, use sort_values(...)
  if __name__ == '__main__':

In [460]:
by_nutrient = ndata.groupby(['nutgroup','nutrient'])

In [461]:
get_maximum = lambda x : x.xs(x.value.idmax())